Tekla Open API Reference for Tekla Structures 2025
PickerInputPoint Properties
The PickerInputPoint type exposes the following members.
Properties
Name | Description
PickedPoint
 The picked point in the view coordinates.
PickedView
 The view within which the pick occurred.
 (Inherited from PickerInputWithinAView.)
Top
See Also
Reference
PickerInputPoint Class
Tekla.Structures.Drawing Namespace